# <center> Week 3 Python Programming - Data Analysis with Pandas</center>
### <center> Saurav Raj Khanal </center>

Python Module
- it is a single python file containing definition, function, classes, and variables that are logically grouped together

Python package
- It is the collection of python modules grouped together within an directory allowing them to be managed as a unit
- each package must contain an __init__.py file, which can be empty

Python Library
- It is a collection of modules and packages bundled together to offer a set of related functionalities


# Import and use Pandas

In [6]:
import pandas as pd

# create new series
number_series = pd.Series([1,2,3,4])

# create new Data Frame
user_data = pd.DataFrame({
    "Name":["Ram","Hari"],
    "Age":[20,23],
    "Adress":["Kathmandu","Lalitpur"]

})
user_data = pd.DataFrame(user_data)
user_data

   Name  Age     Adress
0   Ram   20  Kathmandu
1  Hari   23   Lalitpur

In [13]:
import pandas as pd

# read data from csv
student_csv_data = pd.read_csv("data/student.csv")
student_csv_data.head() # head displays the tops rows

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

# read data from xlsx (Excel) file

In [ ]:
# read data from xlsx
student_excel_data = pd.read_excel("data/student.xlsx")
student_excel_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

# Reading data from json file

In [ ]:
# read data from json 
student_json_data = pd.read_json("data/student.json")
student_json_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [4]:
import pandas as pd
user_data = pd.DataFrame({
    "Name":["Ram","Hari"],
    "Age":[20,23],
    "Adress":["Kathmandu","Lalitpur"]
})

user_data.to_csv('data/user_data.csv')
user_data.to_excel('data/user_data.xlsx')
user_data.to_json('data/user_data.json')

In [1]:
import pandas as pd

students = pd.read_csv('data/student.csv')
students.shape
students.head()
print(students.tail())
print(students.info())
students.describe()

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB
None

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

## Data selection and indexing in pandas

- basic indexing
- label based indexing(.loc[])
- integer label based indexing(.iloc[])
- single values access (.at[], .iat[])

In [12]:
# basic indexing
import pandas as pd
students = pd.read_csv('data/student.csv')
print(students['name'])
new_std_data = students[['id','name','mark']]
print(new_std_data) #multiple columns in dataframe

# Slicing rows
first_10_rows = students[:10].copy()
print(first_10_rows) # only first rows (dataframe)
last_five_rows = students[30:].copy()
print(last_five_rows) # rows from index 30 to last index (dataframe)

0        John Deo
1        Max Ruin
2          Arnold
3      Krish Star
4       John Mike
5       Alex John
6     My John Rob
7          Asruid
8         Tes Qry
9        Big John
10         Ronald
11          Recky
12            Kty
13           Bigy
14       Tade Row
15          Gimmy
16          Tumyu
17          Honny
18          Tinny
19         Jackly
20     Babby John
21         Reggid
22          Herod
23      Tiddy Now
24       Giff Tow
25         Crelea
26       Big Nose
27      Rojj Base
28    Tess Played
29      Reppy Red
30    Marry Toeey
31      Binn Rott
32      Kenn Rein
33       Gain Toe
34     Rows Noump
Name: name, dtype: object
    id         name  mark
0    1     John Deo  75.0
1    2     Max Ruin  85.0
2    3       Arnold  55.0
3    4   Krish Star  60.0
4    5    John Mike  60.0
5    6    Alex John  55.0
6    7  My John Rob  78.0
7    8       Asruid  85.0
8    9      Tes Qry  78.0
9   10     Big John  55.0
10  11       Ronald  89.0
11  12        Recky   NaN
12  13          Kty  88.0
13  14         Bigy  88.0
14  15     Tade Row  88.0
15  16        Gimmy  88.0
16  17        Tumyu  54.0
17  18        Honny  75.0
18  19        Tinny  18.0
19  20       Jackly  65.0
20  21   Babby John  69.0
21  22       Reggid  55.0
22  23        Herod  79.0
23  24    Tiddy Now  78.0
24  25     Giff Tow  88.0
25  26       Crelea  79.0
26  27     Big Nose  81.0
27  28    Rojj Base  86.0
28  29  Tess Played  55.0
29  30    Reppy Red  79.0
30  31  Marry Toeey  88.0
31  32    Binn Rott  90.0
32  33    Kenn Rein  96.0
33  34     Gain Toe  69.0
34  35   Rows Noump  88.0
   id         name  class  mark  gender
0   1     John Deo   Four  75.0  female
1   2     Max Ruin  Three  85.0    male
2   3       Arnold  Three  55.0    male
3   4   Krish Star   Four  60.0  female
4   5    John Mike   Four  60.0  female
5   6    Alex John   Four  55.0    male
6   7  My John Rob  Fifth  78.0    male
7   8       Asruid   Five  85.0    male
8   9      Tes Qry    Six  78.0     NaN
9  10     Big John   Four  55.0  female
    id         name  class  mark  gender
30  31  Marry Toeey   Four  88.0    male
31  32    Binn Rott  Seven  90.0  female
32  33    Kenn Rein    Six  96.0  female
33  34     Gain Toe  Seven  69.0    male
34  35   Rows Noump    Six  88.0  female

# label based index (.loc[])
- .loc is used for selecting rows and columns by label
- we can use single labels, list of labels, or slices of labels

In [23]:
# selecting rows based on label

students = pd.read_csv('data/student.csv')
first_row = students.loc[1]
first_two_rows = students.loc[0:2]
print(first_row)
print(first_two_rows)

# selecting specific rows to column
first_two_stds_with_name_to_marks = students.loc[0:2,'name':'mark']
print(first_two_stds_with_name_to_marks)   # rows 0 to 2, column name to mark

# select only particular rows and columns
first_and_second_row_with_name_and_gender = students.loc[[5,20],['name','gender']]
              #rows 5 and 20, colummn name and gender
            
first_and_second_row_with_name_and_gender

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
       name  class  mark
0  John Deo   Four    75
1  Max Ruin  Three    85
2    Arnold  Three    55

          name  gender
5    Alex John    male
20  Babby John  female

Integer location based indexing
- .iloc[] is used for selecting rows and columns by integer index positions
- similar to .loc[], we can use integer, list of integers, or slices

In [24]:
# selecting rows based on index position
print(students.iloc[1])                    # second row (index 1)
print(students.iloc[0:3])                  # rows at index positions 0 to 2

# selecting specific rows and columns
print(students.iloc[0:2, 0:2])              # rows 0 to 1 column 0 to 1
print(students.iloc[[0,2],[0,2]])           # rows 0 to 2 column 0 to 2

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
   id      name
0   1  John Deo
1   2  Max Ruin
   id  class
0   1   Four
2   3  Three

# Single Value Access (.at[], and .iat[])
- .at[] is used for accessing  a single scalar value by label
- .iat[] is for accessing for index position

In [2]:
#Using .at[] to access single value by label
print(students.at[1,'name'])             #Value in row 1 and column name

# Using .iat[] to access single value by position
print(students.iat[5,1])

Max Ruin
Alex John

## Filtering
- logical opertors(>,<,==,!=)
- multiple logical operators (& (AND) and | (OR))
- Str ancessor, Isin, contains, between, startWith
- Tilde(~)
- Query
- Nlargest and nsmallest
-Loc and iloc

## Logical Operators

In [4]:
# students with marks less than 40

stds_marks_less_than_40 = students[students.mark<40]
print(stds_marks_less_than_40)

boys = students[students.gender == 'male']
boys.head()

    id   name class  mark gender
18  19  Tinny  Nine    18   male

   id         name  class  mark gender
1   2     Max Ruin  Three    85   male
2   3       Arnold  Three    55   male
5   6    Alex John   Four    55   male
6   7  My John Rob  Fifth    78   male
7   8       Asruid   Five    85   male

## Multiple Logical Operators

In [15]:
# students of class 'four' and have marks above 80
class_four_high_marks = students[ (students['class']=='Four') & (students['mark']>80)]
class_four_high_marks.head()

# students of class 'four' and 'five' and have marks above 70
stds_of_fout_five = students[(students['class']=='four') | 
                             (students['class']=='five') &
                             (students['mark'] > 70)
                             ]
stds_of_fout_five.head()

Empty DataFrame
Columns: [id, name, class, mark, gender]
Index: []

## str, lsin, contains, between, startswith

In [12]:

# students whose name starts with 'J'
stds_with_name_j = students[students.name.str.startswith('J')]
stds_with_name_j.head()

stds_with_name_gimmy = students[students.name.str.contains('Gimmy')]
print(stds_with_name_gimmy)

# students with marks between 40 and 50
stds_with_mark_40to50 = students[students.mark.between(40,50)]
stds_with_mark_40to50.head()

# students of class Nine or Ten 
class_nine_or_ten = students[students['class'].isin(['Nine','Ten'])]
class_nine_or_ten

    id   name class  mark gender
15  16  Gimmy  Four    88   male

    id    name class  mark  gender
18  19   Tinny  Nine    18    male
19  20  Jackly  Nine    65  female

## Tilde(~)

In [15]:
# filter students who are not in class 'Nine'

not_class_nine = students[~students['class'].isin(['Nine'])]
not_class_nine.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

## Query

In [19]:
# filter students with marks above 85 and gender is 'male'

query_filter = students.query(" mark > 85 and gender == 'male'")
query_filter.head()

    id         name  class  mark gender
14  15     Tade Row   Four    88   male
15  16        Gimmy   Four    88   male
24  25     Giff Tow  Seven    88   male
30  31  Marry Toeey   Four    88   male

## nlargest and nsmallest

In [20]:
# Get top 3 students with the highest marks
top_3_marks = students.nlargest(3,'mark')
print(top_3_marks)

# Get 2 students with the lowest mark
lowest_2_marks = students.nsmallest(2,'mark')
print(lowest_2_marks)

    id       name  class  mark  gender
32  33  Kenn Rein    Six    96  female
11  12      Recky    Six    94  female
31  32  Binn Rott  Seven    90  female
    id   name class  mark gender
18  19  Tinny  Nine    18   male
16  17  Tumyu   Six    54   male

## loc and iloc

In [21]:
# Using 'loc' to select rows with IDs greater than 2 
loc_filter = students.loc[students['id']>2]
print(loc_filter.head())
## Using 'iloc' to select the first 3 rows
iloc_filter = students.iloc[:3]

   id         name  class  mark  gender
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male